app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("created_at", "post_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 21 Mar 2014 17:28:12 UTC +00:00], ["post_id", 1], ["updated_at", Fri, 21 Mar 2014 17:28:12 UTC +00:00]]
---
  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.build(params.permit[:comment])
  	@comment.save